IDEA Open Model
ThermalConductivityState Enumeration
Compatible with IDEA StatiCa v 10.1
 Type of curvature - thermal conductivity
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public enum ThermalConductivityState
Public Enumeration ThermalConductivityState
public enum class ThermalConductivityState
Members
Member name | Value | Description
None | 0 |  The curvature is not defined
Code | 1 |  The curvatire is defined by the code
User | 5 |  The curvature is input by the user
See Also
Reference
IdeaRS.OpenModel.Material Namespace